html/rust/collection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>集合</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="module.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">集合</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbfba0e0">vector</a>
<ul>
<li><a href="#orga21bec0">新建 vector</a></li>
<li><a href="#org670a45d">更改 vector</a></li>
<li><a href="#orgf86b68f">丢弃 vector 时也会丢弃其所有元素</a></li>
<li><a href="#org303bac9">读取 vector 的元素</a></li>
<li><a href="#org523b7e9">遍历 vector 中的元素</a></li>
<li><a href="#orge8c7e7b">使用枚举来储存多种类型</a></li>
</ul>
</li>
<li><a href="#org9c028a3">String</a></li>
<li><a href="#org289f29e">hashMap</a></li>
</ul>
</div>
</div>
<p>
Rust 标准库中包含一系列被称为 <span class="underline">集合</span> ，非常有用的 <b>数据结构</b> ：
</p>
<ul class="org-ul">
<li>大部分其他数据类型都代表一个特定的值，不过集合可以 <span class="underline">包含多个值</span></li>
<li>不同于内建的数组和元组类型，这些集合指向的数据是 <span class="underline">储存在堆</span> 上的，这意味着数据的数量不必在编译时就已知，并且还可以随着程序的运行增长或缩小</li>
<li>每种集合都有着不同功能和成本，而根据当前情况选择合适的集合，这是一项始终成长的技能</li>
</ul>

<p>
这一章将详细的了解三个在 Rust 程序中被广泛使用的集合：
</p>
<ol class="org-ol">
<li>vector : 允许 <span class="underline">一个挨着一个</span> 地储存一系列数量可变的值</li>
<li>String: 是一个 <span class="underline">字符</span> 的集合</li>
<li>hashMap: 允许将 <span class="underline">值</span> 与一个特定的 <span class="underline">键</span> 相关联</li>
</ol>

<pre class="example">
  接下来将讨论如何创建和更新 vector、字符串和哈希 map，以及它们有什么特别之处
</pre>
<div id="outline-container-orgbfba0e0" class="outline-2">
<h2 id="orgbfba0e0">vector</h2>
<div class="outline-text-2" id="text-orgbfba0e0">
<p>
第一个类型是 <span class="underline">Vec&lt;T&gt;</span> ，也被称为 vector。vector 允许在一个 <b>单独</b> 的数据结构中储存 <b>多于一个</b> 的值：
</p>
<ul class="org-ul">
<li>在 <b>内存中彼此相邻</b> 地排列所有的值</li>
<li>只能储存 <b>相同类型</b> 的值</li>
</ul>

<pre class="example">
    在拥有一系列项的场景下非常实用，例如文件中的文本行或是购物车中商品的价格
</pre>
</div>
<div id="outline-container-orga21bec0" class="outline-3">
<h3 id="orga21bec0">新建 vector</h3>
<div class="outline-text-3" id="text-orga21bec0">
<p>
为了创建一个新的空 vector，可以调用 <span class="underline">Vec::new</span> 函数，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span>: <span style="color: #98fb98;">Vec</span>&lt;<span style="color: #98fb98;">i32</span>&gt; = <span style="color: #98fb98;">Vec</span>::new();
</pre>
</div>

<p>
注意：这里增加了一个 <span class="underline">类型</span> 注解。因为没有向这个 vector 中插入任何值，Rust 并不知道想要储存什么类型的元素
</p>

<pre class="example">
     这是一个非常重要的点：vector 是用泛型实现的，它可以存放任何类型

     而当 Vec 存放某个特定类型时，那个类型位于尖括号中

     在示例中，v 这个 Vec 将存放 i32 类型的元素
</pre>

<p>
在更实际的代码中，一旦插入值 Rust 就可以推断出想要存放的类型，所以你很少会需要这些类型注解。更常见的做法是使用 <span class="underline">初始值</span> 来创建一个 Vec，而且为了方便 Rust 提供了 <span class="underline">vec!</span> 宏。这个宏会根据 <span class="underline">提供的值</span> 来创建一个新的 Vec。下面新建一个拥有值 1、2 和 3 的 Vec&lt;i32&gt;：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3];
</pre>
</div>

<p>
因为提供了 i32 类型的初始值，Rust 可以推断出 v 的类型是 <span class="underline">Vec&lt;i32&gt;</span> ，因此类型注解就不是必须的。接下来让看看如何修改一个 vector
</p>
</div>
</div>
<div id="outline-container-org670a45d" class="outline-3">
<h3 id="org670a45d">更改 vector</h3>
<div class="outline-text-3" id="text-org670a45d">
<p>
对于新建一个 vector 并向其增加元素，可以使用 <span class="underline">push</span> 方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">v</span> = <span style="color: #98fb98;">Vec</span>::new();

v.push(5);
v.push(6);
v.push(7);
v.push(8);
</pre>
</div>

<ul class="org-ul">
<li>如果想要能够改变它的值，必须使用 <span class="underline">mut</span> 关键字使其可变</li>
<li>放入其中的所有值都是 <span class="underline">i32</span> 类型的，而且 Rust 也根据数据做出如此判断，所以不需要 Vec&lt;i32&gt; 注解</li>
</ul>

<pre class="example">
     另外除了 push 之外还有一个 pop 方法，它会移除并返回 vector 的最后一个元素
</pre>
</div>
</div>

<div id="outline-container-orgf86b68f" class="outline-3">
<h3 id="orgf86b68f">丢弃 vector 时也会丢弃其所有元素</h3>
<div class="outline-text-3" id="text-orgf86b68f">
<p>
类似于任何其他的 struct，vector 在其 <b>离开作用域时会被释放</b> ，如下面注释： 
</p>

<div class="org-src-container">
<pre class="src src-rust">{
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3, 4];

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22788;&#29702;&#21464;&#37327; v</span>

} <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&lt;- &#36825;&#37324; v &#31163;&#24320;&#20316;&#29992;&#22495;&#24182;&#34987;&#20002;&#24323;</span>
</pre>
</div>

<pre class="example">
     当 vector 被丢弃时，所有其内容也会被丢弃，这意味着这里它包含的整数将被清理

     这可能看起来非常直观，不过一旦开始使用 vector 元素的引用，情况就变得有些复杂了
</pre>
</div>
</div>

<div id="outline-container-org303bac9" class="outline-3">
<h3 id="org303bac9">读取 vector 的元素</h3>
<div class="outline-text-3" id="text-org303bac9">
<p>
访问 vector 中一个值的两种方式， <span class="underline">索引</span> 语法或者 <span class="underline">get</span> 方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">third</span>: &amp;<span style="color: #98fb98;">i32</span> = &amp;v[2];
<span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"The third element is </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, third);

<span style="color: #00ffff;">match</span> v.get(2) {
    <span style="color: #98fb98;">Some</span>(third) =&gt; <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"The third element is </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, third),
    <span style="color: #98fb98;">None</span> =&gt; <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"There is no third element."</span>),
}
</pre>
</div>

<p>
这里有两个需要注意的地方：
</p>
<ul class="org-ul">
<li>使用 <span class="underline">索引值 2</span> 来获取 <span class="underline">第三个</span> 元素，索引是从 <span class="underline">0</span> 开始的</li>
<li>两个不同的获取第三个元素的方式分别为：
<ul class="org-ul">
<li>使用 <span class="underline">&amp;</span> 和 <span class="underline">[]</span> 返回一个 <b>引用</b></li>
<li>使用 <span class="underline">get</span> 方法以索引作为参数来返回一个 <b>Option&lt;&amp;T&gt;</b></li>
</ul></li>
</ul>

<pre class="example">
Rust 有两个引用元素的方法的原因：程序可以选择如何处理当索引值在 vector 中没有对应值的情况
</pre>

<p>
如果有一个有五个元素的 vector 接着尝试访问索引为 100 的元素时程序会如何处理，如下所示： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">does_not_exist</span> = &amp;v[100];
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">does_not_exist</span> = v.get(100);
</pre>
</div>

<p>
当运行这段代码，对于第一个 [] 方法，当引用一个不存在的元素时 Rust 会 <b>造成 panic</b> 
</p>
<pre class="example">
     这个方法更适合当程序认为尝试访问超过 vector 结尾的元素是一个严重错误的情况，这时应该使程序崩溃
</pre>

<p>
当 get 方法被传递了一个数组外的索引时，它不会 panic 而是 <b>返回 None</b> 
</p>

<pre class="example">
     当偶尔出现超过 vector 范围的访问属于正常情况的时候可以考虑使用它，接着代码可以有处理 Some(&amp;element) 或 None 的逻辑

     例如 索引可能来源于用户输入的数字。如果它们不慎输入了一个过大的数字那么程序就会得到 None 值，可以告诉用户当前 vector 元素的数量并再请求它们输入一个有效的值

     这就比因为输入错误而使程序崩溃要友好的多！
</pre>

<p>
一旦程序获取了一个有效的引用，借用检查器将会执行 <span class="underline">所有权</span> 和 <span class="underline">借用规则</span> 来确保 vector 内容的这个引用和任何其他引用保持有效。当获取了 vector 的 <span class="underline">第一个元素的不可变引用</span> 并尝试在 vector <span class="underline">末尾增加一个元素</span> 的时候，这是行不通的：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">first</span> = &amp;v[0];

v.push(6);

<span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"The first element is: </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, first);
</pre>
</div>

<p>
这时候会有编译报错：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0502]: cannot borrow <span style="color: #fa8072;">`v`</span> as mutable because it is also borrowed as immutable
 --&gt; src/main.rs:7:5
  |
5 |     <span style="color: #b0c4de;">let</span> <span style="color: #eedd82;">first</span> = &amp;v[0];
  |                  - immutable borrow occurs here
6 |
7 |     v.push(6);
  |     ^^^^^^^^^ mutable borrow occurs here
8 |
9 |     println!(<span style="color: #ffa07a;">"The first element is: {}"</span>, first);
  |                                          ----- immutable borrow later used here
</pre>
</div>

<pre class="example">
     不能这么做的原因是由于 vector 的工作方式：

     在 vector 的结尾增加新元素时，在没有足够空间将所有所有元素依次相邻存放的情况下，可能会要求分配新内存并将老的元素拷贝到新的空间中

     这时，第一个元素的引用就指向了被释放的内存

     借用规则阻止程序陷入这种状况
</pre>
</div>
</div>

<div id="outline-container-org523b7e9" class="outline-3">
<h3 id="org523b7e9">遍历 vector 中的元素</h3>
<div class="outline-text-3" id="text-org523b7e9">
<p>
如果想要依次访问 vector 中的每一个元素，可以遍历其所有的元素而无需通过索引一次一个的访问。下面展示了如何使用 <span class="underline">for</span> 循环来获取 i32 值的 vector 中的每一个元素的 <span class="underline">不可变引用</span> 并将其打印：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[100, 32, 57];
<span style="color: #00ffff;">for</span> <span style="color: #eedd82;">i</span> <span style="color: #00ffff;">in</span> &amp;v {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"</span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, i);
}
</pre>
</div>

<p>
也可以遍历可变 vector 的每一个元素的 <span class="underline">可变引用</span> 以便能改变他们。下面的 for 循环会给每一个元素加 50：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[100, 32, 57];
<span style="color: #00ffff;">for</span> <span style="color: #eedd82;">i</span> <span style="color: #00ffff;">in</span> &amp;<span style="color: #00ffff;">mut</span> v {
    *i += 50;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8c7e7b" class="outline-3">
<h3 id="orge8c7e7b">使用枚举来储存多种类型</h3>
<div class="outline-text-3" id="text-orge8c7e7b">
<pre class="example">
vector 只能储存相同类型的值。这是很不方便的；绝对会有需要储存一系列不同类型的值的用例
</pre>

<p>
幸运的是， <span class="underline">枚举</span> 的成员都被定义为相同的枚举类型，所以当需要在 vector 中储存不同类型值时，可以定义并使用一个枚举
</p>

<pre class="example">
假如想要从电子表格的一行中获取值，而这一行的有些列包含数字，有些包含浮点值，还有些是字符串

1. 可以定义一个枚举，其成员会存放这些不同类型的值，同时所有这些枚举成员都会被当作相同类型，那个枚举的类型

2. 接着可以创建一个储存枚举值的 vector，这样最终就能够储存不同类型的值了
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">SpreadsheetCell</span> {
    <span style="color: #98fb98;">Int</span>(<span style="color: #98fb98;">i32</span>),
    <span style="color: #98fb98;">Float</span>(<span style="color: #98fb98;">f64</span>),
    <span style="color: #98fb98;">Text</span>(<span style="color: #98fb98;">String</span>),
}

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">row</span> = <span style="color: #7fffd4;">vec!</span>[
    <span style="color: #98fb98;">SpreadsheetCell</span>::<span style="color: #98fb98;">Int</span>(3),
    <span style="color: #98fb98;">SpreadsheetCell</span>::<span style="color: #98fb98;">Text</span>(<span style="color: #98fb98;">String</span>::from(<span style="color: #ffa07a;">"blue"</span>)),
    <span style="color: #98fb98;">SpreadsheetCell</span>::<span style="color: #98fb98;">Float</span>(10.12),
];
</pre>
</div>

<p>
Rust 在编译时就必须准确的知道 vector 中类型的原因：
</p>
<ol class="org-ol">
<li>它需要知道 <b>储存每个元素</b> 到底 <b>需要多少内存</b></li>
<li>可以准确的知道这个 vector 中 <b>允许什么类型</b> 
<ul class="org-ul">
<li>如果 Rust 允许 vector 存放任意类型，那么当对 vector 元素执行操作时一个或多个类型的值就有可能会造成错误</li>
<li>用枚举外加 match 意味着 Rust 能在编译时就保证总是会处理所有可能的情况</li>
</ul></li>
</ol>

<pre class="example">
     如果在编写程序时不能确切无遗地知道运行时会储存进 vector 的所有类型，枚举技术就行不通了。相反，可以使用 trait 对象
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c028a3" class="outline-2">
<h2 id="org9c028a3">String</h2>
</div>

<div id="outline-container-org289f29e" class="outline-2">
<h2 id="org289f29e">hashMap</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
